Repository: Trap-o/FluffyHelpers-Meditation
Catalog: lib/l10n/app_*.arb
Languages: uk

# constructorTitle
source: Constructor
uk: Конструктор

# feedTitle
source: Feed
uk: Стрічка

# libraryTitle
source: Library
uk: Бібліотека

# playlistCreatorTitle
source: Creating
uk: Створення

# playerTitle
source: Player
uk: Плеєр

# settingsTitle
source: Settings
uk: Налаштування

# mixesListTitle
source: My compositions
uk: Мої композиції

# welcome
source: Let's start meditating today!
uk: Почнімо медитувати вже сьогодні!

# snakeBarText
source: No sounds selected
uk: Не обрано жодного звуку

# titleLabel
source: Title:
uk: Заголовок:

# hintTitleLabel
source: Example: Look at my new playlist!
uk: Наприклад: Перегляньте мій новий плейлист!

# choosePostDescriptionLabel
source: Description:
uk: Опис:

# hintPostDescriptionLabel
source: Add some text about your post
uk: Додайте текст до вашого плейлиста

# playlistsSelectorLabel
source: Select playlists:
uk: Оберіть плейлисти:

# yourPlaylistsLabel
source: Your playlists:
uk: Ваші плейлисти:

# noPlaylistsLabel
source: Create your first playlist
uk: Створіть свій перший плейлист

# noContentError
source: Error: add description or playlists
uk: Помилка: додайте опис чи плейлисти

source: Post created
uk: Допис створено

# mainCategory
source: {key, select, all{All} my{My} relaxation{Relaxation} focus{Focus} sleep{Sleep} other{}}
uk: {key, select, all{Все} my{Моє} relaxation{Релаксація} focus{Фокус} sleep{Сон} other{}}

# subCategoryName
source: {key, select, nature_sounds{Nature sounds} deep_breathing{Deep breathing} calm_music{Calm music} lofi{Lo-Fi} mindfulness{Mindfulness} white_noise{White noise} asmr{ASMR} other{}}
uk: {key, select, nature_sounds{Звуки природи} deep_breathing{Глибоке дихання} calm_music{Спокійна музика} lofi{Lo-Fi} mindfulness{Уважність} white_noise{Білий шум} asmr{ASMR} other{}}

# subCategoryDesciption
source: {key, select, nature_sounds_desc{Calm sounds of nature for deep relaxation and restoration of balance} deep_breathing_desc{Breathing exercises to calm the mind and relieve tension} calm_music_desc{Melodies that promote relaxation and create an atmosphere of harmony} lofi_desc{Light Lo-Fi music to increase concentration and productivity} mindfulness_desc{Sound mindfulness practices to focus on the present moment} white_noise_desc{White noise for falling asleep quickly and resting without disturbances} asmr_desc{Soft sounds and whispers for deep relaxation and stress relief} other{}}
uk: {key, select, nature_sounds_desc{Спокійні звуки природи для глибокого розслаблення та відновлення балансу} deep_breathing_desc{Вправи з дихання для заспокоєння розуму та зняття напруги} calm_music_desc{Мелодії, що сприяють релаксації та створюють атмосферу гармонії} lofi_desc{Легка Lo-Fi музика для підвищення концентрації та продуктивності} mindfulness_desc{Звукові практики усвідомленості для зосередженості на теперішньому моменті} white_noise_desc{Білий шум для швидкого засинання та відпочинку без перешкод} asmr_desc{Тихі звуки та шепіт для глибокої релаксації та полегшення стресу} other{}}

# chooseImageLabel
source: Choose an image for playlist:
uk: Оберіть обкладинку для плейлиста:

# addPhotoLabel
source: Add photo
uk: Додати фото

# addAnotherPhotoLabel
source: Add another photo
uk: Додати інше фото

# chooseCategoryLabel
source: Category:
uk: Категорія:

# chooseDescriptionLabel
source: Description:
uk: Опис:

# hintDescriptionLabel
source: Describe what your playlist looks like
uk: Опишіть що відображено у вашому плейлисті

# compositionsSelectorLabel
source: Select compositions:
uk: Оберіть композиції:

# yourCompositionsLabel
source: Your compositions:
uk: Ваші композиції:

# saveButton
source: Save
uk: Зберегти

# noImageError
source: Error: image not selected
uk: Помилка: зображення не вибрано

# noMusicError
source: Error: music not selected
uk: Помилка: композиції не обрано

# noDescriptionError
source: Error: description not given
uk: Помилка: опис не введено

source: Playlist created
uk: Плейлист створено

# notEnterToAccount
source: Not logged into account
uk: Не увійшли в акаунт

# exitButton
source: Exit
uk: Вийти

# deleteButton
source: Delete account
uk: Видалити акаунт

# settingsSectionCommon
source: Common
uk: Загальні

# settingsSectionAbout
source: About
uk: Про програму

# supportSubject
source: [FluffyHelpers Support] *Topic of question*
uk: [FluffyHelpers Підтримка] *Текст запитання*

# supportMessage
source: Hello! I have question about the app:
uk: Вітаю! Маю питання щодо застосунку:

# languageTitle
source: Language
uk: Мова

# languageOption
source: English
uk: Українська

# petTitle
source: Pet
uk: Тваринка

# petOption
source: {key, select, cat{Cat} dog{Dog} fox{Fox} bunny{Bunny} mouse{Mouse} tiger{Tiger} red_panda{Red panda} raccoon{Raccoon} other{}}
uk: {key, select, cat{Кіт} dog{Пес} fox{Лис} bunny{Кролик} mouse{Мишка} tiger{Тигр} red_panda{Червона панда} raccoon{Єнот} other{}}

source: Notifications
uk: Сповіщення

# githubText
source: GitHub repository for a project
uk: GitHub-репозиторій проєкту

# supportTitle
source: Support
uk: Підтримка

# supportText
source: Write us if you have any questions
uk: Пишіть якщо виникають запитання

# feedbackTitle
source: Feedback
uk: Зворотний зв'язок

# feedbackText
source: Write if you have any suggestions or complaints
uk: Пишіть якщо маєте скарги чи пропозиції

# copyright
source: Developed by Yatsenko Vitalii and Kyrychok Sofiia
uk: Розроблено Яценко Віталієм та Киричок Софією

# okButton
source: Confirm
uk: ОК

# cancelButton
source: Cancel
uk: Скасувати

# confirmationText
source: Deleting your account will delete your profile, all your playlists, music you've created, and more. Are you sure?
uk: Видалення акаунту призведе до видалення профілю, всіх ваших плейлистів, створеної музики тощо. Ви впевнені?

# playlistNameText
source: Enter a playlist name:
uk: Введіть назву плейлиста:

# noNameError
source: Error: name not given
uk: Помилка: назву не введено

# mixNameText
source: Enter a composition name:
uk: Введіть назву композиції:
